# -*- coding: utf-8 -*-
# -*- mode: org -*-
# The title page is hacked and generated below
#+Title:  Generating a Controled Software Environment with Debian Snapshot Archive
#+Author: Arnaud Legrand, Univ. Grenoble Alpes, CNRS, Inria, Grenoble INP
#+DATE:  \vspace{1cm} \href{http://hpc.guix.info/events/2021/atelier-reproductibilité-environnements}{Software Environment Reproducibility}, May 2021\hfill \mylogo\vspace{-1.3cm}
# # #+DATE: \vspace{1cm} /Reproductibilité des environnements logiciels/, May 2021\hfill \mylogo\vspace{-1.3cm}
#+LANGUAGE: en
#+STARTUP: beamer indent inlineimages logdrawer
#+TAGS: noexport(n)

#+PROPERTY: header-args  :session :eval never-export :exports both
#+DRAWERS: latex_headers

# The magic presentation command: impressive -T 100 -t Crossfade --fake-fullscreen -g 800x600 talk_21_05_10_SIF.pdf

:latex_headers:
#+LaTeX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt,presentation,xcolor={usenames,dvipsnames,svgnames,table}]
#+OPTIONS:   H:2 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_COMPILER: lualatex
#+LATEX_HEADER: \usedescriptionitemofwidthas{bl}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{figlatex}
#+LATEX_HEADER: \usepackage[french]{babel}
#+LATEX_HEADER: %\usepackage{DejaVuSansMono}
#+LATEX_HEADER: \usepackage{ifthen,amsmath,amstext,gensymb,amssymb}
#+LATEX_HEADER: \usepackage{boxedminipage,xspace,multicol}
#+LATEX_HEADER: %%%%%%%%% Begin of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \ProcessOptionsBeamer
#+LATEX_HEADER: \usetheme[numbering=fraction,titleformat=smallcaps,progressbar=frametitle]{metropolis}
#+LATEX_HEADER: \usepackage{fontawesome}
#+LATEX_HEADER: \usecolortheme[named=BrickRed]{structure}
#+LATEX_HEADER: %%%%%%%%% End of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \usepackage{verbments}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{url} \urlstyle{sf}
** Using Docker
Let's grab a docker image from a 10 years old distro and consider
Pedro used Debian stable (codename *Lenny* back then)
  #+begin_src shell :results output :exports both
  docker search debian-lenny
  #+end_src

  #+RESULTS:
  #+begin_example
  NAME                       DESCRIPTION                                    
  pblaszczyk/debian-lenny    5.0.10 amd64                                   
  lpenz/debian-lenny-amd64   Debian 5.0.10 Released 10 March 2012 for amd…  
  lpenz/debian-lenny-i386    Debian 5.0.10 Released 10 March 2012 for i386  
  ...
  #+end_example
Then write the Dockerfile
